HW2/rails-intro/app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.ratings

    @selected_ratings = params[:ratings] || session[:ratings]
    @selected_ratings = Hash[@all_ratings.collect {|rating| [rating, 1]}] unless @selected_ratings
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG') ORDER BY release_date