HW4/bdd-tdd-cycle/rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "10"]]
---
  def destroy
    @movie = Movie.find(params[:id])

SELECT "movies".* FROM "movies" WHERE "movies"."id" IS NULL LIMIT 1
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'
---
  def by_director
    movie = Movie.find_by_id(params[:movie_id])
    @movies = Movie.find_all_by_director(movie.director)